{'gallery': ['https://platform.cstatic-images.com/xlarge/in/v2/5958bb8b-1647-5cc2-bc61-a62cc2ff2094/12dcbd25-44a5-4f7e-8dfb-d0cae7927285/bBjaIb0TUU-rcJqV_6s1RZQJRj4.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/5958bb8b-1647-5cc2-bc61-a62cc2ff2094/12dcbd25-44a5-4f7e-8dfb-d0cae7927285/TMbbqLwSn9NgIbjLpBzhV3mEk5M.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/5958bb8b-1647-5cc2-bc61-a62cc2ff2094/12dcbd25-44a5-4f7e-8dfb-d0cae7927285/EfkhX_I3pLWQnteM0NsWbutZnNE.jpg'], 'card_id': 'V4407A', 'url': 'https://www.cars.com/vehicledetail/ecee77a7-d81f-4725-b7ee-e1845733fe20/', 'title': '2023 Volkswagen Taos 1.5T SE', 'price_primary': '$29,960', 'price_history': '3/03/23: $29,960 | 4/09/23: $31,000 | 4/23/23: $29,960 ', 'options': [], 'vehicle_history': 'Accidents or damage: None reported | 1-owner vehicle: Yes | Personal use only: Yes ', 'comment': 'Certified. 2023 Volkswagen Taos 1.5T SE 1.5L I4 Turbocharged DOHC 16V LEV3-SULEV30 158hp 7-Speed DSG Automatic with Tiptronic AWD Pure White CARFAX One-Owner. Clean CARFAX. Odometer is 2274 miles below market average! Taos 1.5T SE, Volkswagen Certified Pre-Owned Certified, 4D Sport Utility, AWD, Pur|…|e White, 4-Wheel Disc Brakes, 5.20 Axle Ratio, 6 Speakers, ABS brakes, Air Conditioning, Alloy wheels, AM/FM radio: SiriusXM with 360L, Auto High-beam Headlights, Brake assist, Bumpers: body-color, CloudTex & Cloth Seating Surfaces, Compass, Delay-off headlights, Driver door bin, Driver vanity mirror, Dual front impact airbags, Dual front side impact airbags, Electronic Stability Control, Exterior Parking Camera Rear, Four wheel independent suspension, Front anti-roll bar, Front Bucket Seats, Front Center Armrest, Front reading lights, Front Strut Rear Multi-Link Suspension, Fully automatic headlights, Heated door mirrors, Heated Front Comfort Seats, Heated front seats, Heated steering wheel, Illuminated entry, Leather Shift Knob, Low tire pressure warning, Occupant sensing airbag, Outside temperature display, Overhead airbag, Overhead console, Panic alarm, Passenger door bin, Passenger vanity mirror, Power door mirrors, Power driver seat, Power steering, Power windows, Radio data system, Radio: MIB3 Composition Media AM/FM/HD, Rain sensing wipers, Rear anti-roll bar, Rear seat center armrest, Rear window defroster, Rear window wiper, Remote keyless entry, Roof rack: rails only, Security system, Speed control, Speed-sensing steering, Split folding rear seat, Spoiler, Steering wheel mounted audio controls, Tachometer, Telescoping steering wheel, Tilt steering wheel, Traction control, Trip computer, Variably intermittent wipers, Wheels: 18 2-Tone Machined Alloy, Taos 1.5T SE, 4D Sport Utility, AWD, Pure White. Volkswagen Certified Pre-Owned Details:  Warranty Deductible: $50  For CPO Vehicles purchased on or after January 5, 2021: MY17 and older vehicles are eligible for a 2 year, 24,000 mile whichever occurs first, limited warranty. MY18 and MY19 vehicles are eligible for a 1 year, 12,000 mile whichever occurs first, limited warranty. MY2020+ vehicles are eligible for a 2 year, 24,000 mile whichever occurs first, limited warranty. 3 month SiriusXM Platinum Plan trial subscription.  100+ Point Inspection  Roadside Assistance  Vehicle History', 'location': '14700 Jefferson Davis Hwy Woodbridge, VA 22191', 'labels': 'Great Deal | $1,085 under|CPO Warrantied|VIN: 3VVYX7B21PM318630|Included warranty', 'description': '2023, 7-Speed Automatic, –, –, 650 mi. | suv, –, Pure White', 'scrap_date': '2023-05-04 08:52:33'}