{'gallery': ['https://platform.cstatic-images.com/xlarge/in/v2/eb2d3576-757b-5218-a7e7-f4b00d44ce8e/423f6ffe-a1d8-4297-a615-c20b7327ecaf/jbnlKUkSk27DP9mv7wRrfHrCktk.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/eb2d3576-757b-5218-a7e7-f4b00d44ce8e/423f6ffe-a1d8-4297-a615-c20b7327ecaf/x6bTEOiAtXVn00_7ahhbfU0siL0.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/eb2d3576-757b-5218-a7e7-f4b00d44ce8e/423f6ffe-a1d8-4297-a615-c20b7327ecaf/5Mqn7g08Y7CljPr7agVWSn6BKHY.jpg'], 'card_id': '3012112A', 'url': 'https://www.cars.com/vehicledetail/6b71d5c1-76db-4598-ae5c-5450640b2c70/', 'title': '2023 Subaru Legacy Premium', 'price_primary': '$27,955', 'price_history': '', 'options': [], 'vehicle_history': 'Accidents or damage: None reported | 1-owner vehicle: Yes | Personal use only: Yes ', 'comment': "CERTIFIED PRE OWNED 2023 SUBARU LEGACY PREMIUM AWDLOW MILEAGECLEAN CAR FAXONE OWNERLOCALLY OWNEDThis Subaru Legacy has a dependable Regular Unleaded H-4 2.5 L/152 engine powering this Variable transmission. TITANIUM GRAY, CLOTH UPHOLSTERY -inc: silver or ivory stitching, STANDARD MODEL, RE|…|AR BUMPER APPLIQUE -inc: Part number E771SAN000, EXTERIOR & INTERIOR AUTO DIMMING HL MIRRORS -inc: Auto-Dimming Mirror w/Compass & HomeLink, Part number H501SAN000, Exterior Auto-Dimming Mirror w/Approach Light, Part number J201SAN300, CRYSTAL BLACK SILICA.This Subaru Legacy Comes Equipped with These Options ALL-WEATHER FLOOR LINERS -inc: Part number J501SAN100, Window Grid Antenna, Wheels: 17 x 7.5J Aluminum-Alloy Black -inc: machine finish and silver aluminum-alloy wheel center cap w/Subaru 6 star logo, Voice Activated Dual Zone Front Automatic Air Conditioning, Variable Intermittent Wipers w/Heated Wiper Park, Valet Function, Trunk Rear Cargo Access, Trip computer, Transmission: Lineartronic CVT -inc: straight-type shift lever w/shift position indicator, steering wheel paddle-shift control switches, 8-speed manual shift mode, lock-up torque converter, incline start assist and adaptive control, Tires: 225/55R17 97V All-Season, Tire Specific Low Tire Pressure Warning, Strut Front Suspension w/Coil Springs, Steel Spare Wheel, STARLINK Security Plus (6-months free trial) Tracker System, Single Stainless Steel Exhaust.Living In The Fast Lane Doesn't Mean Compromising On Quality with This Subaru Legacy Premium According to Carfax's history report: Carfax One-Owner Vehicle, No Damage Reported, No Accidents Reported.Stop By Today Come in for a quick visit at Volvo of Melbourne, 4340 W. New Haven Blvd, Melbourne, FL 32904 to claim your Subaru Legacy!", 'location': '4340 W New Haven Ave Melbourne, FL 32904', 'labels': 'Great Deal | $1,675 under|CPO Warrantied|VIN: 4S3BWAC63P3005246|Included warranty', 'description': '2023, 8-Speed CVT w/OD, Regular Unleaded H-4 2.5 L/152, –, 2 501 mi. | sedan, –, Crystal Black Silica', 'scrap_date': '2023-05-04 08:23:08'}