{'gallery': ['https://platform.cstatic-images.com/xlarge/in/v2/4db177e7-6855-4248-917d-2b19e1c1465c/8d3086ea-8391-4161-9dd7-10be430bdc6a/nrUnbEqpEAgyZDLK9yH3A-XwhSU.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/4db177e7-6855-4248-917d-2b19e1c1465c/8d3086ea-8391-4161-9dd7-10be430bdc6a/cwYEfwpNeLjTNZWUzGrEJQUk6yg.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/4db177e7-6855-4248-917d-2b19e1c1465c/8d3086ea-8391-4161-9dd7-10be430bdc6a/a-LwY3uz8rizK9QoweQhzqBPY5U.jpg'], 'card_id': 'L157', 'url': 'https://www.cars.com/vehicledetail/0b12da67-4cfc-4365-936d-e47ee98f3c41/', 'title': '2023 Subaru Legacy Premium', 'price_primary': '$27,811', 'price_history': '3/28/23: $27,999 | 4/12/23: $25,650 | 4/15/23: $26,121 | 4/22/23: $27,811 ', 'options': [], 'vehicle_history': 'Accidents or damage: None reported | Clean title: Yes | 1-owner vehicle: Yes | Personal use only: Yes ', 'comment': 'CARFAX 1-Owner, ONLY 1,840 Miles! PRICE DROP FROM $29,811, EPA 35 MPG Hwy/27 MPG City! Heated Seats, Dual Zone A/C, Apple CarPlay CLICK NOW! KEY FEATURES INCLUDE All Wheel Drive, Heated Driver Seat, Back-Up Camera, Satellite Radio, iPod/MP3 Input, Onboard Communications System, Aluminum Wheels, Dual|…|Zone A/C, Smart Device Integration, Lane Keeping Assist, Apple CarPlay, Brake Actuated Limited Slip Differential, Heated Seats MP3 Player, Child Safety Locks, Steering Wheel Controls, Electronic Stability Control, Heated Mirrors. Subaru Premium with Crystal White Pearl exterior and Titanium Gray interior features a 4 Cylinder Engine with 182 HP at 5800 RPM. OPTION PACKAGES BSD W/RCTA KEYLESS ACCESS LED FOG LIGHTS system off switch, exterior power mirrors w/Blind Spot Detection/Rear Cross Traffic Alert detection indicator, rear radar detection sensors, lane change assist, audible vehicle detection warning and automatic emergency steering off indicator, EyeSight System, automatic emergency steering, Blind Spot Detection (BSD), Black Fog Light Aerodynamic Covers w/Inserts, Rear Cross Traffic Alert (RCTA), audible vehicle detection warning, Keyless Access w/Push Button Start, laser cut master key, remote transmitter w/removable key, spare remote transmitter w/removable key, illuminated engine start/stop switch, shift lever park engagement display and audible warning, starter override protection, driver and front passenger door unlock/lock sensor, trunk lid, POPULAR PACKAGE #1 Auto-Dimming Mirror w/Compass HomeLink, Rear Bumper Applique, Exterior Auto-Dimming Mirror w/Approach Light, Cargo Tray. A GREAT TIME TO BUY Reduced from $29,811. PURCHASE WITH CONFIDENCE CARFAX 1-Owner Horsepower calculations based on trim engine configuration. Fuel economy calculations based on original manufacturer data for trim engine configuration. Please confirm the accuracy of the included equipment by calling us prior to purchase.', 'location': '1400 South 33rd Street Philadelphia, PA 19146', 'labels': 'Good Deal|CPO Warrantied|VIN: 4S3BWAD60P3005848|Included warranty', 'description': '2023, Variable, 2.5 L 4, –, 1 840 mi. | sedan, –, Crystal White Pearl', 'scrap_date': '2023-05-04 08:33:22'}