{'gallery': ['https://platform.cstatic-images.com/xlarge/in/v2/0067a8fc-c35a-5876-8852-8d1f331cc9bd/b3b0dd3d-6077-4c2f-ab59-451b94984706/0m3iRyt9tZIt4o26IsLzdjnCaSQ.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/0067a8fc-c35a-5876-8852-8d1f331cc9bd/b3b0dd3d-6077-4c2f-ab59-451b94984706/j1q3LbzPl-DT7AgXdPagph53da0.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/0067a8fc-c35a-5876-8852-8d1f331cc9bd/b3b0dd3d-6077-4c2f-ab59-451b94984706/7uo7p3evR4Fi-n93CVhXmX0BjJQ.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/0067a8fc-c35a-5876-8852-8d1f331cc9bd/b3b0dd3d-6077-4c2f-ab59-451b94984706/-5L0iw3LuC7XCU_ApeJtg45I2V8.jpg', 'https://platform.cstatic-images.com/xlarge/in/v2/0067a8fc-c35a-5876-8852-8d1f331cc9bd/b3b0dd3d-6077-4c2f-ab59-451b94984706/GnCkRtlPtdQ-jE3R-oJTd3JQPiE.jpg'], 'card_id': 'T4669B', 'url': 'https://www.cars.com/vehicledetail/ea9fd9b5-ceeb-4ef4-87ad-49de0c048469/', 'title': '2023 Honda Civic Sport', 'price_primary': '$29,500', 'price_history': '', 'options': [], 'vehicle_history': 'Accidents or damage: None reported | 1-owner vehicle: Yes | Personal use only: Yes ', 'comment': "One Owner, Factory Warranty, 2.0L I4, Bluetooth, Hands-Free, 7 Color Touchscreen, Appple CarPlay, Android Auto, 18 Black Alloy Wheels, Distance Pacing, Traffic Jam Assist, Collision Mitigation Braking System, Forward Collision Warning, Lane Keeping Assistance, Lane Departure Warning, Low Tire Pressu|…|re Warning, Back-Up Camera Dont Trade It, Sell It! We need TRUCKS, CARS, and SUVs NOW! Get up to $3000 Over KBB Fair Trade Value in just minutes and WE PAY MORE! Easy, Convenient, and Fast with a Free Online Car Appraisal. Highest Rated Dealer In Florida with a Five Star Google Review Rating. WE ARE DRIVING HAPPINESS! CHANGING THE STEREOTYPE IN CAR BUYING! Autoline Preowned is a Family Owned and Operated Independent Dealer Since 2004. You can forget the stereotypical car buying experience and enjoy our no-pressure and laid-back atmosphere that will make buying your next vehicle a pleasure. Our number one goal is to make sure you leave happy whether you purchase a vehicle or not! Still Need More Reasons To Choose Autoline? - We have a 5 Star Google Review Rating (Highest Rated In Florida) - Voted #1 Best Place To Buy Your Next Car Ten Years In A Row! - We buy less than 3% of the 1000+ vehicles we research each week. - We outsell 98% of all new and used car dealerships in Florida. - We Buy Cars even if you don't buy one from us in 30 mins or less. To see more Autoline inventory, go to: www.AutolinePreowned.com This 2023 Honda Civic Sedan comes with a CARFAX Buyback Guarantee, which means you can buy with certainty. Why does this vehicle look so great? The CARFAX report shows it's only been owned by one owner. Why spend more money than you have to? This Honda Civic Sedan will h", 'location': '2126 Mayport Rd Jacksonville, FL 32233', 'labels': 'Good Deal|Hot Car|VIN: 2HGFE2F53PH515169', 'description': '2023, Automatic, 2.0L I4 16V GDI DOHC, Gasoline, 3 801 mi. | sedan, Front-wheel Drive, Sonic Gray Pearl', 'scrap_date': '2023-05-01 08:05:14'}